// ******************************************************************************************************
// *            adc.cpp
// ******************************************************************************************************
// ******************************************************************************************************
// *
// * This information is proprietary to Eaton | Powerware 
// *
// ******************************************************************************************************
// *
// *  Copyright (c) 2008 Eaton | Powerware
// *    ALL RIGHTS RESERVED
// *
// ******************************************************************************************************
// ******************************************************************************************************
// *    FILE NAME: adc.cpp
// *
// *    DESCRIPTION: 
// *
// *    ORIGINATOR: Kevin VanEyll
// *
// *    DATE: 2/19/2010
// *
// *    HISTORY: See Subversion history.
// ******************************************************************************************************

// ******************************************************************************************************
// *            Include Files
// ******************************************************************************************************
#include "DSP28x_Project.h"     // Device Headerfile and Examples Include File
#include "Constants.h"
#include "adc.h"
#include "F28335Port.h"
#include "InverterControl.h"
#include "RectifierStateControl.h"
#include "Algos.h"
#include "Eeprom_map.h"
#include "debugger.h"
#include "BatteryConverterControl.h"
#include "CriticalSection.h"
#include "InvSync.h"
#include "ExtSignalPLL.h"
#include "MCUState.h"
#include "PeriodicTSKs.h"
#include "BatteryStateControl.h"
#include <math.h>
#include <clk.h>
#include "Version.h"
#include "BypassInterface.h"

extern "C" {
    void adc_isr( void );
    void AdcDMAConfigure( void );
}

inline void WaveformCapture( void );
inline void TestESSTransferTime(void);
//
// File data
//
const uint16_t NumberOfAdcFastChannels    = 24;               //
uint16_t ADMuxState = 0;                                      // state variable for A/D mux

uint16_t EssTimeCount = 0;
float EssTransferTime = 0;
bool EssTimeTest = false;
bool record_uv_time = false;

//const stSecondOrderIIRFP SdFilterCoefficients         = { 0.3811,   1, 0, -0.2378, 0,  0,  0 };
stSecondOrderIIRFP SdFilter_40KHz         = { 0.03706,   1, 0, -0.9259, 0,  0,  0 };
stPark             OutputVoltageDQ;

uAdcCalibration               CalibrationScaler;            // calibration table, local

// this one's volatile, even to us
volatile int16_t AdcDMABuffer[2][32];

uRawAdcData RawAdcData;                   // all raw adc data
volatile const uRawAdcData * const RawAdcDataPtr = &RawAdcData;

uAdcSlowDataRaw      SlowAdcData;                      // slow channels processed @5.1kHz ProcessADC_HWI
volatile const uAdcSlowDataRaw * const SlowAdcDataPtr = &SlowAdcData;

// zero ref data
typedef struct
{
    int16_t   phA;
    int16_t   phB;
    int16_t   phC;
} stACCurrentAutoZero;        

int16_t AnalogZeroRaw = 0;	  // referenced to OpAref signal
int16_t AnalogZeroDouble = 0; // referenced to OpAref signal * 2
int16_t AnalogZero = 0;       // referenced to OpAref signal
int16_t AnalogZeroRawDouble = 0;// referenced to OpAref signal*2

// referenced to OpAref signal, B7_0
int16_t NullData = 0;                                         // place holder
stACCurrentAutoZero InputCurrentAutoZero    = { 4096, 4096, 4096 };      // will need autozeroing of current sensors someday, setting to AD range for now
stACCurrentAutoZero InverterCurrentAutoZero = { 4096, 4096, 4096 };
stACCurrentAutoZero BypassCurrentAutoZero   = { 4096, 4096, 4096 };
int16_t BattCurrentPosAutoZero = 4096;
int16_t BattCurrentNegAutoZero = 4096;
float InvVoltScalerPhaseA = 1.0f;
float InvVoltScalerPhaseB = 1.0f;
float InvVoltScalerPhaseC = 1.0f;
extern uint16_t NewCtrlBoard;

//run time counter
//static unsigned long CLK_EnterISRCnt = 0;
//static unsigned long CLK_ExitISRCnt = 0;

#pragma DATA_SECTION( "ramdata" );
int16_t const * const FastAdcZero[] =
{
    &BattCurrentNegAutoZero,        // Ibat2,   A3_1
    &NullData,                      // REF1.5,  A4_1
    &NullData,                      // 12V,     A5_1
    &BypassCurrentAutoZero.phA,     // IoutA,   B3_1
    &BypassCurrentAutoZero.phB,     // IoutB,   B4_1
    &BypassCurrentAutoZero.phC,     // IoutC,   B5_1
    &AnalogZeroDouble,              // Vbat,    A0_1
    &AnalogZeroDouble,              // Vbat1,   A1_1
    &BattCurrentPosAutoZero,        // Ibat1,   A2_1
    &AnalogZeroRawDouble,           // VbypA,   B0_1,
    &AnalogZeroRawDouble,           // VbypB,   B1_1,
    &AnalogZeroRawDouble,           // VbypC,   B2_1,
    
    &InputCurrentAutoZero.phA,      // IinA,    A3_0
    &InputCurrentAutoZero.phB,      // IinB,    A4_0
    &InputCurrentAutoZero.phC,      // IinC,    A5_0
    &InverterCurrentAutoZero.phA,   // IinvA,   B3_0
    &InverterCurrentAutoZero.phB,   // IinvB,   B4_0
    &InverterCurrentAutoZero.phC,   // IinvC,   B5_0
    &AnalogZeroRawDouble,           // VinA,    A0_0
    &AnalogZeroRawDouble,           // VinB,    A1_0
    &AnalogZeroRawDouble,           // VinC,    A2_0
    &AnalogZeroRawDouble,           // VinvA,   B0_0
    &AnalogZeroRawDouble,           // VinvB,   B1_0
    &AnalogZeroRawDouble,           // VinvC,   B2_0
};

#pragma DATA_SECTION( "ramdata" );
int16_t const * const SlowAdcZero[] =
{
    &AnalogZero,                    // VinN,    B7_0 
    &AnalogZero,                    // InvdcA,  A7_0
    &NullData,                      // Rtemp,   B7_1
    &AnalogZero,                    // InvdcB,  A7_1
    &NullData,                      // Itemp,   B7_2
    &AnalogZero,                    // InvdcC,  A7_2
    &NullData,                      // Btemp,   B7_3
    &AnalogZeroRaw,                 // VoutA,   A7_3
    &NullData,                      // STStemp, B7_4
    &AnalogZeroRaw,                 // VoutB,   A7_4
    &NullData,                      // +15V     B7_5
    &AnalogZeroRaw,                 // VoutC,   A7_5
//	    &AnalogZeroRaw,                 // Vbat+,   B7_6
    &NullData,                      // +24V,   B7_6
    &AnalogZeroRaw,                 // Vbat,   A7_6
    &AnalogZeroRaw,                 // ChassisVoltage,B7_7
//	    &NullData                       // Ref1,    A7_7      
    &AnalogZeroRaw,                 // Vbat+,   A7_6
};

#pragma DATA_SECTION( "ramdata" );
int16_t * const SlowAdcResultRaw[] =
{
    &SlowAdcData.st.LogicPower24v,
    &SlowAdcData.st.InputVoltageNeutral,
    &SlowAdcData.st.PhaseATemperature,
    &SlowAdcData.st.PhaseCTemperature
};

#pragma DATA_SECTION( "ramdata" );
volatile const int16_t * const SlowAdcDataRaw[4][4] =
{
    {
        &AdcDMABuffer[1][SLOW_LOGIC_24V_IDX],
        &AdcDMABuffer[1][SLOW_VBATT_IDX],
        &AdcDMABuffer[1][SLOW_CHASSIS_VOLTS_IDX],
        &AdcDMABuffer[1][SLOW_VBATT_POS_IDX]
    },
    {
        &AdcDMABuffer[0][SLOW_UTIL_VOLTS_N_IDX],
        &AdcDMABuffer[0][SLOW_INV_DC_PHA_IDX],
        &AdcDMABuffer[0][SLOW_RECT_TEMP_IDX],
        &AdcDMABuffer[0][SLOW_INV_DC_PHB_IDX]
    },
    {
        &AdcDMABuffer[1][SLOW_INV_TEMP_IDX],
        &AdcDMABuffer[1][SLOW_INV_DC_PHC_IDX],    
        &AdcDMABuffer[1][SLOW_BAT_TEMP_IDX],
        &AdcDMABuffer[1][SLOW_OUT_V_PHA_IDX]
    },
    {
        &AdcDMABuffer[0][SLOW_STS_TEMP_IDX],
        &AdcDMABuffer[0][SLOW_OUT_V_PHB_IDX],
        &AdcDMABuffer[0][SLOW_LOGIC_15V_IDX],
        &AdcDMABuffer[0][SLOW_OUT_V_PHC_IDX]
    }
};

#pragma DATA_SECTION( "ramdata" );
float * const MedAdcResult[] =
{
    &RawAdcData.st.AMBTemperature,
    &RawAdcData.st.RailVoltageNegative
};

#pragma DATA_SECTION( "ramdata" );
float * const MedAdcCal[] =
{
//	    &CalibrationScaler.st.BypassNeutralCal,
	&CalibrationScaler.st.AMBTemperatureCal,
    &CalibrationScaler.st.RailVoltageNegativeCal
};

#pragma DATA_SECTION( "ramdata" );
volatile const int16_t * const MedAdcData[2][4] =
{
    {
        &AdcDMABuffer[1][MEDIUM_AMB_TEMP_IDX],
        &AdcDMABuffer[1][MEDIUM_BYPASS_V_B_IDX],
        &AdcDMABuffer[1][MEDIUM_SCR_TEMP_IDX],  //MEDIUM_RECTCAP_TEMP_IDX
        &AdcDMABuffer[1][MEDIUM_BYPASS_V_C_IDX]
    },
    {
        &AdcDMABuffer[0][MEDIUM_RAIL_NEGATIVE_IDX],
        &AdcDMABuffer[0][MEDIUM_RAIL_POSITIVE_IDX],
        &AdcDMABuffer[0][MEDIUM_INVCAP_TEMP_IDX],
        &AdcDMABuffer[0][MEDIUM_BYPASS_V_A_IDX]
    }
};

#pragma DATA_SECTION( "ramdata" );
int16_t * const MedAdcZero[2][4] =
{
    {
        &NullData,		//AMB_TEMP
        &AnalogZero,	//BYP_V_B
        &NullData,		//SCR_TEMP
        &AnalogZero		//BYP_V_C
    },
    {
        &AnalogZero,	//RAIL_NEGATIVE
        &AnalogZero,	//RAIL_POSITIVE
        &NullData,		//INV_CAP_TEMP
        &AnalogZero		//BYP_V_A
    }
};

// Zhangjun : the following code is for FCT purpose and should be integrated
typedef struct
{
    // 'medium' A/D Mux group 0 
    int16_t         RailVoltageNegative;            // A6
    int16_t         RailVoltagePositive;            // B6
    // 'medium' A/D Mux group 1
    int16_t         InvCapTemperature;              // A6
    int16_t         BypassVoltage2phA;              // B6
    // 'medium' A/D Mux group 2
    int16_t         AMBTemperature;                 // A6
    int16_t         BypassVoltage2phB;              // B6
    // 'medium' A/D Mux group 3
    int16_t         SCRTemperature;                  // A6    RecCapTemperature
    int16_t         BypassVoltage2phC;              // B6
    
    // slow A/D 0  
    int16_t         InputVoltageNeutral;            // B7
    int16_t         InverterDCPhaseA;               // A7
    // slow A/D 1
    int16_t         PhaseBTemperature;              //          RectifierTemperature;          // B7
    int16_t         InverterDCPhaseB;               // A7
    // slow A/D 2
    int16_t         PhaseATemperature;          // B7
    int16_t         InverterDCPhaseC;               // A7
    // slow A/D 3
    int16_t         BatteryTemperature;           // B7
    int16_t         OutputVoltagePhaseA;            // A7
    // slow A/D 4
    int16_t         PhaseCTemperature;                 // B7
    int16_t         OutputVoltagePhaseB;            // A7
    // slow A/D 5
    int16_t         LogicPower15v;                  // B7
    int16_t         OutputVoltagePhaseC;            // A7
    // slow A/D 6
    int16_t         LogicPower24v;         			// B7
    int16_t         BatteryVoltage;         // A7
    // slow A/D 7
    int16_t         ChassisVoltage;                // B7
    int16_t         CalibrationRef1;                // A7    
}stADC_STRUCT;

typedef union
{
    stADC_STRUCT st;
    int16_t words[sizeof(stADC_STRUCT)];
}unADC_UNION;

unADC_UNION Adc_Sample;

#pragma DATA_SECTION( "ramdata" );
int16_t * const SlowAdcSample[] =
{
    &Adc_Sample.st.LogicPower24v,
    &Adc_Sample.st.InputVoltageNeutral,
    &Adc_Sample.st.PhaseATemperature,
    &Adc_Sample.st.PhaseCTemperature
};

#pragma DATA_SECTION( "ramdata" );
int16_t * const MedAdcSample[] =
{
    &Adc_Sample.st.AMBTemperature,
    &Adc_Sample.st.RailVoltageNegative
};
// Zhangjun : the above code is for FCT purpose and should be integrated

//
// Global data
// 
stThreePhase OutputCurrent = {0, 0, 0};
stThreePhase InputCurrentWithCap = {0, 0, 0};


const uAdcCalibration UnitOfMeasureConversions_HV_20K =
//	{	//HW-Ver01(before 2021.4.7): 20K
//	    // 12-bit A/D, 0-3V = 3/(2^12) = 0.000732422 V/bit. Divide by circuit gain
